Revit 2026 API

# StairsComponentConnection Class

---

Represents information about a connection among stairs components(run to landing).

SystemObject Autodesk.Revit.DB.ArchitectureStairsComponentConnection

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StairsComponentConnection : IDisposable
```
```vb
Public Class StairsComponentConnection
	Implements IDisposable
```
```cpp
public ref class StairsComponentConnection : IDisposable
```
```fsharp
type StairsComponentConnection =
    class
        interface IDisposable
    end
```

The StairsComponentConnection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionType | The connection type of the connected stairs component. |
|  | ElementId | The element Id of connected stairs component in the stairs connection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PeerConnectionType | The connection type of the peer connected stairs component. |
|  | PeerElementId | The element Id of peer connected stairs component in the stairs connection. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the StairsComponentConnection |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Architecture Namespace